export default {
  PAGE_HEADING: "Общи условия на CreoWeb",
  TERM_BLOCKS: [
    {
      HEADING: "Добре дошли в CreoWeb!",
      TEXT: `
<p>
Благодарим ви, че използвате нашите продукти и услуги („Услуги“).
</p>`.trim(),
    },
    {
      HEADING: "Използване на нашите Услуги",
      TEXT: `
<p>
Трябва да спазвате всички правила, които ви се предоставят в Услугите.
</p>
<p>
Не злоупотребявайте с Услугите ни. Например не ги възпрепятствайте
и не се опитвайте да осъществявате достъп до тях по начин, 
различен от предоставените от нас интерфейс и инструкции. 
Можете да използвате нашите Услуги единствено както е разрешено 
от закона, включително приложимите закони и разпоредби за контрол 
на износа и реекспорта. Може да преустановим или спрем да ви 
предоставяме Услугите си, ако не спазвате условията или 
правилата ни или ако извършваме проверка на предполагаема злоупотреба.
</p>
<p>
Във връзка с използването на Услугите от ваша страна може да ви 
изпращаме служебни или администраторски съобщения и друга информация.
</p>`.trim(),
    },
    {
      HEADING: "Съдържанието ви в нашите Услуги",
      TEXT: `
<p>
Някои от Услугите ни ви позволяват да качвате, подавате, 
съхранявате, изпращате или получавате съдържание. Вие си 
запазвате всички права на интелектуална собственост, които 
имате за него. Накратко, това, което ви принадлежи, си остава ваше.
</p>
<p>
Ако имате Профил в CreoWeb, може да показваме името и снимката на Профила Ви.
</p>`.trim(),
    },
    {
      HEADING: "Промяна и прекратяване на Услугите ни",
      TEXT: `
<p>
Постоянно променяме и подобряваме Услугите си. Може периодично 
да добавяме или премахваме функционалност или характеристики, 
както и да преустановим или спрем изцяло дадена Услуга.
</p>
<p>
Можете да спрете да използвате Услугите ни по всяко време, въпреки 
че ще съжаляваме, че се отказвате. CreoWeb може също да спре да ви
предоставя Услугите или по всяко време да добави или създаде 
нови ограничения за тях.
</p>`.trim(),
    },
    {
      HEADING: "Нашите гаранции и откази от отговорност",
      TEXT: `
<p>
Предоставяме Услугите си с уменията и грижата на добрия търговец и 
се надяваме, че ще ви е приятно да ги използвате. Има някои неща 
относно тях обаче, за които не даваме обещания.
</p>
<p>
ОСВЕН КАКТО Е ИЗРИЧНО ПОСОЧЕНО В НАСТОЯЩИТЕ ИЛИ В ДОПЪЛНИТЕЛНИ 
УСЛОВИЯ, НИТО CREOWEB, НИТО НАШИТЕ ДОСТАВЧИЦИ ИЛИ ДИСТРИБУТОРИ 
ДАВАТ КАКВИТО И ДА Е КОНКРЕТНИ ОБЕЩАНИЯ ОТНОСНО УСЛУГИТЕ. НАПРИМЕР 
НЕ ПОЕМАМЕ НИКАКВИ АНГАЖИМЕНТИ ОТНОСНО СЪДЪРЖАНИЕТО В УСЛУГИТЕ, 
КОНКРЕТНАТА ИМ ФУНКЦИОНАЛНОСТ, ТЯХНАТА НАДЕЖДНОСТ, ДОСТЪПНОСТ 
ИЛИ СПОСОБНОСТ ДА ОТГОВОРЯТ НА НУЖДИТЕ ВИ. ПРЕДОСТАВЯМЕ УСЛУГИТЕ 
ВЪВ ВИДА, В КОЙТО СА.
</p>`.trim(),
    },
    {
      HEADING: "Отговорност за нашите Услуги",
      TEXT: `
<p>
КОГАТО ТОВА Е РАЗРЕШЕНО ОТ ЗАКОНА, CREOWEB И НАШИТЕ ДОСТАВЧИЦИ И 
ДИСТРИБУТОРИ НЕ НОСЯТ ОТГОВОРНОСТ ЗА ПРОПУСНАТИ ПОЛЗИ, ПРИХОДИ 
ИЛИ ДАННИ, ФИНАНСОВИ ЗАГУБИ ИЛИ КОСВЕНИ, СПЕЦИАЛНИ, ПРОИЗТИЧАЩИ, 
ПРИМЕРНИ ИЛИ НАКАЗАТЕЛНИ ЩЕТИ.
</p>
<p>
ДОКОЛКОТО ТОВА Е РАЗРЕШЕНО ОТ ЗАКОНА, ОБЩАТА ОТГОВОРНОСТ НА CREOWEB 
ЗА ВСЕКИ ИСК СЪГЛАСНО ТЕЗИ УСЛОВИЯ, ВКЛЮЧИТЕЛНО ЗА ВСИЧКИ 
ПОДРАЗБИРАЩИ СЕ ГАРАНЦИИ, СЕ ОГРАНИЧАВА ДО СУМАТА, КОЯТО СТЕ 
НИ ПЛАТИЛИ ЗА ИЗПОЛЗВАНЕТО НА УСЛУГИТЕ (ИЛИ ПО НАШ ИЗБОР, 
ДО ТОВА ДА ВИ ПРЕДОСТАВИМ УСЛУГИТЕ ОТНОВО).
</p>
<p>
ВЪВ ВСИЧКИ СЛУЧАИ CREOWEB НЕ НОСИ ОТГОВОРНОСТ ЗА НИКАКВИ ЗАГУБИ 
ИЛИ ЩЕТИ, КОИТО НЕ СА РАЗУМНО ПРЕДВИДИМИ.
</p>`.trim(),
    },
    
  ],
};