export default {

  LANGUAGE_MENU: {
    LABEL: "Език",
    LANGUAGES: {
      EN: "Английски",
      BG: "Български",
    },
  },

  HOME: {
    LOGIN_BUTTON: "Вход",
    SIGNUP_BUTTON: "Регистрация",
    LOGOUT_BUTTON: "Излез",
    GO_TO_DASHBOARD_BUTTON: "Към главното табло",
    SHOWCASE_SUBTITLE: "Стани част от бъдещето на <b>уеб</b> пространството.",
    SHOWCASE_DESCRIPTION: "<b>CreoWeb</b> е <b>модерна</b> платформа за създаване на <b>динамични</b> уебсайтове, които отговарят на <b>очакванията на потребителите.</b>",
    INFO_ROW: { 
      FIRST: {
        TITLE: "Лесно",
        CONTENT: "Създавай динамични уебсайтове с удобен потребителски интерфейс."
      },
      SECOND: {
        TITLE: "Динамично",
        CONTENT: "Прави това, което 💗 с мощни дизайнерски инструменти.",
      },
      THIRD: {
        TITLE: "Модерно",
        CONTENT: "Използвай последните иновативни технологии и създай чудесен собствен уебсайт.",
      },
    },
    SHOWCASE_NEXT_TITLE: "CreoWeb",
    SHOWCASE_NEXT_SUBTITLE: "Създай <b>страхотни динамични уебсайтове</b> с няколко клика на мишката.",
    SHOWCASE_NEXT_DESCRIPTION: "Започни успешно с големия набор от <b>начални проекти</b> и над <b><a href='https://www.npmjs.com/#pane-what-can-you-make' target='_blank'>400'000 готови пакета</a></b>.",
  },

  EDITOR: {
    CONTENT_TAB: "Съдържание",
    RESOURCES_TAB: "Ресурси",
    DETAILS_TAB: "Детайли",
    COMPONENTS_TAB: "Компоненти",
    PREVIEW_TAB: "Дизайн",
    CONSOLE_TAB: "Конзола",

    GREETER: {
      HEADER: "Знаеше ли, че?..",
      SCREENS: {
        ADDING_CONTENT: {
          TITLE: "Добавяне на ново съдържание",
          CONTENT: "Можеш да добавиш ново съдържание към елемент, избирайки го в панела за предварителен преглед и кликайки плюс иконата на който и да е елемент в панела с компоненти.",
        },
        CHANGING_STYLES: {
          TITLE: "Промяна на стиловете на елемент",
          CONTENT: "Добавянето на нови стилове към елемент е много лесно. Пробвай да селектираш елемента в панела за предварителен преглед, след това отиди в панела с детайли и добави ново свойство \"style\" (ако отсъства). Маркирай типа на свойството като \"dictionary\" и пробвай нещо, като например да промениш стойността на свойството \"background\" (добави го, ако отсъсва) на \"peachpuff\"."
        }
      },
    },


    PANEL_DISABLED_NOTIFICATION: "Панелът е изключен по време на тестване.",

    TOOLBAR: {
      PLAY_TOOLTIP: "Пусни",
      PAUSE_TOOLTIP: "Спри",
      DOWNLOAD_TOOLTIP: "Запази",
      SETTINGS_TOOLTIP: "Настройки",
    },

    LAYOUTS_MENU: {
      LABEL: "Изглед",
      LAYOUTS: {
        COMPACT: "Компактен",
        WIDE: "Широк",
      },
    },

    SETTINGS_DIALOG: {
      DIALOG_TITLE: "Настройки",
      CANCEL_BUTTON: "Отмени",
      APPLY_BUTTON: "Приложи",
      COMPONENT_PROPS_TITLE: "Свойства на компонента",
      PROPS_EXPLAIN: "Това са свойствата, от които се нуждае компонента, когато бива използван като шаблон.",
      COMPONENT_SETTINGS_TITLE: "Настройки на компонента",
      EDITOR_SETTINGS_TITLE: "Настройки на редактора",
      PROPS_TABLE: {
        NAME_HEADER: "Име",
        TYPE_HEADER: "Тип",
        DEFAULT_VALUE_HEADER: "По подразбиране",
        REQUIRED_HEADER: "Задължително",
        ACTIONS_HEADER: "Действия",
      },
      COMPONENT_STATE_TITLE: "Променливи на компонента",
      STATE_EXPLAIN: "Това са променливите, които компонента използва.",
    },

    SAVE_DIALOG: {
      DIALOG_TITLE: "Запазване на проект",
      CANCEL_BUTTON: "Отмени",
      SAVE_BUTTON: "Запази",
    },

    EXTERNAL_COMP_DIALOG: {
      CANCEL_BUTTON: "Отмени",
      CREATE_BUTTON: "Създай",
      TITLE: "Свържи външен компонент",
      SELECTOR_LABEL: "Селектор",
      DEFAULT_EXPORT_HINT: "<използвай експортираната стойност по подразбиране>",
    },

    PANELS: {
      COMPONENT_LIST: {
        VIEW_REFERENCE_TOOLTIP: 'Виж справката',
        ADD_TO_SELECTION_TOOLTIP: 'Добави към селекцията',
        OPEN_IN_EDITOR_TOOLTIP: 'Отвори в редактора',
        SEARCH_HINT: "Търси",
        NAME_HEADER: "Име",
        ACTIONS_HEADER: "Действия",
        HTML_NAV_ITEM: "HTML",
        USER_NAV_ITEM: "Потребителски",
        EXTERNAL_NAV_ITEM: "Външни"
      },

      RES_VIEWER: {
        LOCAL_LABEL: "Локални",
        GLOBAL_LABEL: "Глобални",
        EXTERNAL_LABEL: "Пакети",
        FILES_LABEL: "Файлове",
        NAME_HEADER: "Име",
        VERSION_HEADER: "Версия",
        ACTIONS_HEADER: "Действия",
        DATA_TYPE_HEADER: "Тип на данните",
        VIEW_REFERENCE_TOOLTIP: "Виж справката",
        EDITING_HEADER: "Редактор на ресурси",
        RES_NAME_HINT: "Име",
        PKG_NAME_HINT: "Пакет",
      },

      NODE_CHILDREN: {
        HOW_TO: {
          LABEL: "Помощ",
          TITLE: "Как да използвам панела Съдържание?",
          CONTENT: "Панела съдържание показва съдържанието на избрания елемент, както и съдържанието на всичките му родителски елементи. С панела Съдържание, можеш да пренареждаш, създаваш копие, редактираш и премахваш съдържанието на даден елемент."
        },
        CONTENT_OF_PREFIX: "Съдържание на",
      },

    }
  },

  DASHBOARD: {
    SITES: {
      LIST_EMPTY: "Нямате никакви уебсайтове.",
    },
  },

  LOGIN: {
    LOGIN_HEADER: "Вход",
    LOGIN_BUTTON: "Влез",
    EMAIL_LABEL: "Имейл",
    PASSWORD_LABEL: "Парола",
    REMEMBER_ME: "Запомни ме"
  },

  SIGNUP: {
    SIGNUP_HEADER: "Регистрация",
    SIGNUP_SUCCESS: "Вашата регистрация беше успешна!",

    PERSONAL_INFORMATION_HEADER: "Лична информация",
    CREDENTIALS_HEADER: "Удостоверение",
    CREATE_PASSWORD_HEADER: "Създайте парола",

    SIGNUP_BUTTON: "Регистрация",
    FIRST_NAME_LABEL: "Собствено име",
    LAST_NAME_LABEL: "Фамилно име",
    USERNAME_LABEL: "Потребителско име",
    EMAIL_LABEL: "Имейл",
    PASSWORD_LABEL: "Парола",
    CONFIRM_PASSWORD_LABEL: "Потвърждение на паролата",
    BIRTH_DATE_LABEL: "Дата на раждане",

    USERNAME_EXISTS: "Това потребителско име вече съществува.",
    EMAIL_EXISTS: "Този имейл вече съществува.",
    PASSWORDS_DONT_MATCH: "Тези пароли не съвпадат.",

    START_CREATING_BUTTON: "Започни да създаваш",

    I_AGREE_TERMS: "Съгласен съм с <a href=\"/Policies/TermsOfUse\" target=\"_blank\">Общите Условия</a>.",

    NEXT_BUTTON: "Продължи",
    FINISH_BUTTON: "Завърши",
    BACK_BUTTON: "Назад",
  },

  HELP_DIALOG: {
    TITLE: 'Помощ',
    CLOSE_BUTTON: 'Затвори'
  },

  TERMS_OF_USE: require('./blocks/terms-bg').default,

  VALIDATE: {
    EMAIL_EMPTY: "Полето за имейл не може да бъде празно.",
    EMAIL_INVALID: "Моля, въведете валиден имейл.",

    PASSWORD_EMPTY: "Полето за парола не може да бъде празно.",
    PASSWORD_TOO_SHORT: "Паролата трябва да бъде поне 8 символа.",
    PASSWORD_TOO_LONG: "Паролата не трябва да бъде повече от 16 символа.",
    PASSWORD_INVALID: "Паролата трябва да съдържа поне 1 главна буква, 1 малка буква и число.",

    FIRST_NAME_EMPTY: "Името не може да бъде празно.",
    FIRST_NAME_BEGIN_SPACE: "Името не може да започва със празно място.",
    FIRST_NAME_END_SPACE: "Името не може да завършва със празно място.",
    FIRST_NAME_MULTIPLE_SPACES: "Името не може да съдържа няколко последователни празни места.",
    FIRST_NAME_TOO_LONG: "Името не може да бъде повече от 50 символа.",

    LAST_NAME_EMPTY: "Името не може да бъде празно.",
    LAST_NAME_BEGIN_SPACE: "Името не може да започва със празно място.",
    LAST_NAME_END_SPACE: "Името не може да завършва със празно място.",
    LAST_NAME_MULTIPLE_SPACES: "Името не може да съдържа няколко последователни празни места.",
    LAST_NAME_TOO_LONG: "Името не може да бъде повече от 50 символа.",

    USERNAME_EMPTY: "Потребителското име не може да бъде празно.",
    USERNAME_TOO_SHORT: "Потребителското име трябва да бъде поне 8 символа.",
    USERNAME_TOO_LONG: "Потребителското име не може да бъде повече от 25 символа.",
    USERNAME_INVALID: "Потребителското име трябва да бъде буквено-цифрена последователност от символи и може също да съдържа \"-\", \"_\" или \".\".",

  }

};